import image1 from '../../../images/carouselmages/apologetics.jpeg';
import image2 from '../../../images/carouselmages/studyBible.jpg';
import image3 from '../../../images/carouselmages/history.jpeg';
import image4 from '../../../images/carouselmages/soulsupport.jpeg';
import image5 from '../../../images/carouselmages/churchleadership.jpeg';
import image6 from '../../../images/carouselmages/preaching.jpeg';
import image7 from '../../../images/carouselmages/bogoslovie.jpeg';
import image8 from '../../../images/carouselmages/mission.jpeg';
import image9 from '../../../images/carouselmages/goodnews.jpeg';
import image10 from '../../../images/carouselmages/cornerstone.jpeg';

export const divContent = [
  {
    id: 1,
    title: 'Апологетика',
    description:
      'Основные принципы апологетики в христианстве, изучающие защиту веры через логику, философию и историю. Курсы включают в себя основные аргументы за истинность христианства.',
    info: '124+ Курсы',
    image: image1,
    alt: 'Изображение для Апологетика',
  },
  {
    id: 2,
    title: 'Библеистика',
    description:
      'Исследование Библии и её текстов, углубляющее понимание исторических и культурных контекстов, в которых она была написана. Курсы включают в себя изучение авторства.',
    info: '98+ Курсы',
    image: image2,
    alt: 'Изображение для Библеистика',
  },
  {
    id: 3,
    title: 'История Церкви',
    description:
      'Исторические аспекты развития христианской Церкви, охватывающие ключевые события, фигуры и доктринальные споры.',
    info: '76+ Курсов',
    image: image3,
    alt: 'Изображение для История Церкви',
  },
  {
    id: 4,
    title: 'Душепопечение',
    description:
      'Руководство по духовному сопровождению, охватывающее методы и техники помощи верующим в их духовном росте и личной жизни.',
    info: '112+ Курсов',
    image: image4,
    alt: 'Изображение для Душепопечение',
  },
  {
    id: 5,
    title: 'Руководство в церкви',
    description:
      'Практические навыки лидерства в церковной общине, охватывающие стратегии управления и развития церковных структур.',
    info: '88+ Курсов',
    image: image5,
    alt: 'Изображение для Руководство в церкви',
  },
  {
    id: 6,
    title: 'Проповедь',
    description:
      'Техники и методы проповеди в христианстве, охватывающие анализ исторических и современных подходов к проповедничеству.',
    info: '135+ Курсов',
    image: image6,
    alt: 'Изображение для Проповедь',
  },
  {
    id: 7,
    title: 'Богословие',
    description:
      'Основные принципы богословия и теологии, охватывающие изучение ключевых доктрин и учений христианства. Курсы включают в себя анализ теологических споров.',
    info: '103+ Курса',
    image: image7,
    alt: 'Изображение для Богословие',
  },
  {
    id: 8,
    title: 'Миссия',
    description:
      'Миссионерская деятельность и стратегии, охватывающие разработку и реализацию миссионерских программ и проектов.',
    info: '91+ Курс',
    image: image8,
    alt: 'Изображение для Миссия',
  },
  {
    id: 9,
    title: 'Благовестие',
    description:
      'Методы и практики благовестия, охватывающие различные стратегии проповедничества и распространения евангельского послания.',
    info: '118+ Курсов',
    image: image9,
    alt: 'Изображение для Благовестие',
  },
  {
    id: 10,
    title: 'Основание церквей',
    description:
      'Мастер-классы по стратегиям создания и развития церковных общин, включая управление ресурсами, формирование сообщества и миссионерскую деятельность.',
    info: '82+ Курса',
    image: image10,
    alt: 'Изображение для Основание церквей',
  },
];