import image1 from '../../../images/feedbackImages/01.png';
import image2 from '../../../images/feedbackImages/02.png';
import image3 from '../../../images/feedbackImages/03.png';

export const feedbackData = [
  {
    text: "Обучение разочаровало — слишком много теории и мало практики. Материал подаётся скучно, а поддержка преподавателей оставляет желать лучшего.",
    image: image1,
    name: "Иван Петров",
    info: "Студент 1-го курса",
    colorCode: 0
  },
  {
    text: "Курсы интересные и насыщенные, но иногда ощущается нехватка практических занятий. В целом, обучение на хорошем уровне.",
    image: image2,
    name: "Анна Смирнова",
    info: "Студентка 3-семестра",
    colorCode: 1
  },
  {
    text: "Программа соответствует ожиданиям, преподаватели компетентны. Иногда хотелось бы больше обратной связи по заданиям.",
    image: image3,
    name: "Алексей Иванов",
    info: "Абитуриент",
    colorCode: 2
  },
  {
    text: "Очень доволен качеством обучения! Материал подаётся понятно, а преподаватели всегда поддерживают студентов в сложных вопросах.",
    image: image1,
    name: "Сергей Кузнецов",
    info: "Студент",
    colorCode: 3
  },
  {
    text: "Обучение превзошло мои ожидания! Отличная атмосфера и профессиональные преподаватели помогли мне значительно улучшить знания.",
    image: image2,
    name: "Мария Васильева",
    info: "Студентка",
    colorCode: 4
  }
];
